Revit 2026 API

# ModelPathUtilsConvertUserVisiblePathToModelPath Method

---

Converts a user-visible path (string) to a ModelPath.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ModelPath ConvertUserVisiblePathToModelPath(
	string strPath
)
```
```vb
Public Shared Function ConvertUserVisiblePathToModelPath (
	strPath As String
) As ModelPath
```
```cpp
public:
static ModelPath^ ConvertUserVisiblePathToModelPath(
	String^ strPath
)
```
```fsharp
static member ConvertUserVisiblePathToModelPath :
        strPath : string -> ModelPath
```

#### Parameters

strPath String
     The path in string form, like RSN://{HostNodeName}/school/project.rvt

#### Return Value

ModelPath A ModelPath representing either a server or file path.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The path may be a server or file path.

#### Reference

ModelPathUtils Class

Autodesk.Revit.DB Namespace